public/about-me.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About Me</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles/org.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">About Me</h1>
<p>
A stranger and a wayfarer in this life.
</p>

<blockquote>
<p>
يا ابن آدم، إنما أنت أيام، كلما ذهب يوم ذهب بعضك.
الحسن البصري
</p>
</blockquote>

<p>
Hello! I'm Khaled Mustafa—a technical educator, embedded software engineer, and electronics enthusiast. I thrive at the intersection of teaching and technology, crafting solutions and guiding others on their own learning paths.
</p>

<p>
Welcome to my corner of the internet! Here, you’ll find a blend of my professional journey, technical projects, and personal insights.
</p>

<p>
Curious about what I’ve been building? Explore my projects on GitHub.
</p>

<p>
Let’s connect! You can find me on <a href="https://www.linkedin.com/in/khaled-mustafa/">LinkedIn</a>, or if you’d like to chat directly, feel free to <a href="mailto:khaled.mustafa.elsayed@outlook.com">mail me</a>—I’d love to hear from you.
</p>

<p>
Wondering how this site was crafted using the magic of Emacs? <a href="about-site.html">Click here</a> for the behind-the-scenes details.
</p>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
